In [1]:
!pip install sqlalchemy
!pip install --upgrade sqlalchemy
!pip install pymysql

Requirement already satisfied: sqlalchemy in /Users/natalielewis/anaconda3/lib/python3.11/site-packages (1.4.39)
Requirement already satisfied: sqlalchemy in /Users/natalielewis/anaconda3/lib/python3.11/site-packages (1.4.39)
Collecting sqlalchemy
  Obtaining dependency information for sqlalchemy from https://files.pythonhosted.org/packages/3f/ec/d285f944d47d885a84fdd2c2c7b1de10a106a7206a7d56325b772d09ffeb/SQLAlchemy-2.0.25-cp311-cp311-macosx_11_0_arm64.whl.metadata
  Downloading SQLAlchemy-2.0.25-cp311-cp311-macosx_11_0_arm64.whl.metadata (9.6 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/natalielewis/anaconda3/lib/python3.11/site-packages (from sqlalchemy) (4.7.1)
Downloading SQLAlchemy-2.0.25-cp311-cp311-macosx_11_0_arm64.whl (2.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.1/2.1 MB 3.6 MB/s eta 0:00:0000:0100:01
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.4.39
    Uninstalling SQLAlchemy-1.4.39:
      Successfully uninstalled SQLAlchemy-1.4.39
Successfully installed sqlalchemy-2.0.25
Collecting pymysql
  Obtaining dependency information for pymysql from https://files.pythonhosted.org/packages/e5/30/20467e39523d0cfc2b6227902d3687a16364307260c75e6a1cb4422b0c62/PyMySQL-1.1.0-py3-none-any.whl.metadata
  Using cached PyMySQL-1.1.0-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 302.9 kB/s eta 0:00:000:00:01
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [2]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

········

Engine(mysql+pymysql://root:***@localhost/sakila)

In [4]:
from sqlalchemy import text

In [5]:
with engine.connect() as connection:
    query = text('SELECT * FROM actor')
    result = connection.execute(query)
result

In [13]:
def rentals_month(engine,month:int,year:int):
    with engine.connect() as connection:
        txt = f'''select *,
                  year(rental_date) as 'year',
                  month(rental_date) as 'month'
                  from rental
                  where year(rental_date)={year} and month(rental_date)={month};'''
        
        query = text(txt)
        result = connection.execute(query)
        df  = pd.DataFrame(result.all())
        return df

In [14]:
rentals_month(engine,5,2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,year,month
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005,5
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005,5
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005,5
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005,5
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005,5
...,...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,2005,5
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,2005,5
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,2005,5
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,2005,5
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,2005,5

In [15]:
def rental_count_month(rentals_df, month, year):
    """
    Count the number of rentals made by each customer_id during the selected month and year.

    Returns:
    Pandas DataFrame containing the number of rentals per customer_id.
    """
    column_name = f"rentals_{month:02d}_{year}"

    rental_counts = rentals_df.groupby('customer_id').size().reset_index(name=column_name)

    return rental_counts

In [21]:
rentals_df = rentals_month(engine, month=5, year=2005)
rental_counts_df = rental_count_month(rentals_df, month=5, year=2005)
rental_counts_df.head()

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [17]:
def compare_rentals(rentals_df1, rentals_df2):
    """
    Compare the number of rentals made by each customer in two different DataFrames.

    Returns:
    Combined Pandas DataFrame with a new 'difference' column.
    """
    merged_df = pd.merge(rentals_df1, rentals_df2, on='customer_id', how='outer')

    merged_df = merged_df.fillna(0)

    merged_df['difference'] = merged_df.iloc[:, 1] - merged_df.iloc[:, 2]

    return merged_df

In [22]:
rentals_df1 = rental_count_month(rentals_month(engine, month=5, year=2005), month=5, year=2005)
rentals_df2 = rental_count_month(rentals_month(engine, month=6, year=2005), month=6, year=2005)

comparison_df = compare_rentals(rentals_df1, rentals_df2)
comparison_df.head()

   customer_id  rentals_05_2005  rentals_06_2005  difference
0            1              2.0              7.0        -5.0
1            2              1.0              1.0         0.0
2            3              2.0              4.0        -2.0
3            5              3.0              5.0        -2.0
4            6              3.0              4.0        -1.0

In [23]:
def compare_rentals(rentals_df1, rentals_df2):
    """
    Compare the number of rentals made by each customer in two different DataFrames.

    Returns:
    Combined Pandas DataFrame with a new 'difference' column.
    """
    merged_df = pd.merge(rentals_df1, rentals_df2, on='customer_id', how='inner')

    merged_df = merged_df.fillna(0)

    merged_df['difference'] = merged_df.iloc[:, 1] - merged_df.iloc[:, 2]

    return merged_df

In [24]:
rentals_df1 = rental_count_month(rentals_month(engine, month=5, year=2005), month=5, year=2005)
rentals_df2 = rental_count_month(rentals_month(engine, month=6, year=2005), month=6, year=2005)

comparison_df = compare_rentals(rentals_df1, rentals_df2)
comparison_df.head()

   customer_id  rentals_05_2005  rentals_06_2005  difference
0            1                2                7          -5
1            2                1                1           0
2            3                2                4          -2
3            5                3                5          -2
4            6                3                4          -1